Repository: mmarcec007/typo3_76_demo
Catalog: web/typo3conf/ext/metaseo/Resources/Private/Language/TCA/*.locallang.xlf
Languages: de

# pages.palette.pagetitle
source: Pagetitle
de: Seitentitel

# pages.palette.crawler
source: Searchengines
de: Suchmaschinen

# pages.tx_metaseo_pagetitle
source: title-TAG (absolute, without prefix/suffix)
de: title-TAG (absolut, ohne Prefix/Suffix)

# pages.tx_metaseo_pagetitle_rel
source: Browsertitle
de: Browsertitel

# pages_language_overlay.tx_metaseo_pagetitle_rel
source: Browsertitle
de: Browsertitel

# pages.tx_metaseo_is_exclude
source: Exclude page from SearchEngines
de: Seite von Suchmaschinen ausschließen

# pages.tx_metaseo_pagetitle_prefix
source: Prefix (inheritable)
de: Präfix (vererbbar)

# pages.tx_metaseo_pagetitle_suffix
source: Suffix (inheritable)
de: Suffix (vererbbar)

# pages.tx_metaseo_inheritance
source: Inheritance mode
de: Vererbungsmodus

# pages.tx_metaseo_canonicalurl
source: Canonical URL (if your content is a copy from another webpage, link here to it)
de: Canonical URL (Wenn der Inhalt der Webseite von einer Anderen übernommen worden ist, hier die URL dieser Seite eintragen)

# pages.tx_metaseo_geo_lat
source: Latitude
de: Breitengrad

# pages.tx_metaseo_geo_long
source: Longitude
de: Längengrad

# pages.tx_metaseo_geo_place
source: City/Place
de: Stadt/Standort

# pages.tx_metaseo_inheritance.I.1
source: Skip (don't herit from this page)
de: Überspringen (von dieser Seite nicht vererben)

# pages.tx_metaseo_priority
source: Priority (0-100)
de: Priorität (0-100)

# pages.tx_metaseo_change_frequency
source: Page change frequency
de: Änderungshäufigkeit der Seite

# pages.tx_metaseo_change_frequency.I.0
source: Default (see constants)
de: Standard (siehe Konstanten)

# pages.tx_metaseo_change_frequency.I.1
source: Always
de: Immer

# pages.tx_metaseo_change_frequency.I.2
source: Hourly
de: Stündlich

# pages.tx_metaseo_change_frequency.I.3
source: Daily
de: Täglich

# pages.tx_metaseo_change_frequency.I.4
source: Weekly
de: Wöchentlich

# pages.tx_metaseo_change_frequency.I.5
source: Monthly
de: Monatlich

# pages.tx_metaseo_change_frequency.I.6
source: Yearly
de: Jährlich

# pages.tx_metaseo_change_frequency.I.7
source: Never (archive)
de: Nie (Archivseite)

# tx_metaseo_setting_root
source: SEO Settings for Root
de: SEO Einstellungen für Website

# tx_metaseo_setting_root.is_sitemap
source: Sitemap active
de: Sitemap aktiv

# tx_metaseo_setting_root.is_sitemap_page_indexer
source: Page indexer
de: Seiten-Indizierung

# tx_metaseo_setting_root.is_sitemap_page_indexer.description
source: Page indexer
de: Seiten-Indizierung

# tx_metaseo_setting_root.is_sitemap_typolink_indexer
source: TypoLink indexer
de: TypoLink-Indizierung

# tx_metaseo_setting_root.is_sitemap_language_lock
source: Enable language-domain support (lock output to current language)
de: Sprach-Domain Unterstützung aktivieren (Sitemap gibt nur aktuelle Sprache aus)

# tx_metaseo_setting_root.sitemap_page_limit
source: Sitemap.xml entry page limit (keep empty to use default of 1000)
de: Sitemap.xml Einträge pro Seite (Leer für Standard von 1000 Einträgen)

# tx_metaseo_setting_root.sitemap_priority
source: Priority (if page have no priority) (default:1)
de: Priorität (wenn bei Seite nicht gesetzt) (Standard:1)

# tx_metaseo_setting_root.sitemap_priority_depth_multiplier
source: Priority depth multiplier (default:1)
de: Priorität Seitentiefe Multiplikator (Standard:1)

# tx_metaseo_setting_root.sitemap_priority_depth_modificator
source: Priority depth modificator (default:1)
de: Priorität Seitentiefe Modifikator (Standard:1)

# tx_metaseo_setting_root.is_robotstxt
source: Robots.txt active
de: Robots.txt aktiv

# tx_metaseo_setting_root.is_robotstxt_sitemap_static
source: Link to static sitemap.xml (scheduler-task needed)
de: Statische sitemap.xml nutzen (Planer Task wird benötigt)

# tx_metaseo_setting_root.robotstxt
source: Robots.txt content (replaces default robots.txt content)
de: Robots.txt Inhalt (Ersetzt den Standard Inhalt der robots.txt)

# tx_metaseo_setting_root.robotstxt_additional
source: Robots.txt additional content (below default)
de: Robots.txt Zusatzinhalt (wird unter dem Standard ausgegeben)

# is_sitemap_page_indexer.description
source: If enabled the url of the generated and cached pages will be indexed for the sitemap. This indexing is slow.
de: Wenn diese Option aktiviert ist wird die URL der generierten und gecachten Seite für die Sitemap indziert. Diese Indizierung ist relativ langsam.

# is_sitemap_typolink_indexer.description
source: If enabled the url of links generated by the typolink-function will be indexed for the sitemap. This indexing is fast.
de: Wenn diese Option aktiviert ist wird die URL der Links, die über die typolink-Funktion generiert werden, indiziert. Diese Indizierung ist schnell.

# is_sitemap_language_lock.description
source: Enable this if you have multiple domains pointing to different languages, eg. example.de points to the german version and example.com to the english version. The generated sitemap will only output the current language and no other language sites.
de: Aktivieren Sie diese Option wenn Sie pro Sprache eine unterschiedliche Domain nutzen wollen, z.B. example.de für Deutsch und example.com für Englisch. Die Ausgabe der Seitemap wird auf die aktuelle Sprache beschränkt, auf der Seitemap von example.com werden folglich nur englische Einträge angezeigt.

# robotstxt.description
source: If there is no content in this field the standard robots.txt is generated (from TypoScript setup plugin.metaseo.robotsTxt)
de: Wenn dieses Feld leer ist wird die Standard robots.txt generiert (definiert im TypoScript Setup plugin.metaseo.robotsTxt)

# robotstxt_additional.description
source: Will be placed under the default or custom robots.txt
de: Dieser Inhalt wird unter die Ausgabe der robots.txt gesetzt.

# is_robotstxt_sitemap_static.description
source: Normally, the %sitemap% marker links to the dynamic version of the sitemap. If this is enabled the %sitemap% marker links to the static file version generated by the scheduler.
de: Normalerweise verweist der Marker %sitemap% auf die dynamische Sitemap-Generierung. Ist diese Option aktiv wird stattdessen auf die statische Version verlink. Hierfür wird ein Planer-Task benötigt, der die statsiche Version generiert.
